"""Написать функцию перевода десятичного числа в двоичное и обратно, без
использования функции int"""

def foo(a):
    b = bin(a)
    print(b)
    print(a)


number = 10 #ввод числа
    #int(input("Введите число которое нужно перевести из десятичного в двоичное и обратно ")))
foo(number)

